In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.2.2'

In [20]:
df = pd.read_csv('green_tripdata_2019-10.csv.gz', low_memory=False)

In [21]:
df.count()

VendorID                 387007
lpep_pickup_datetime     476386
lpep_dropoff_datetime    476386
store_and_fwd_flag       387007
RatecodeID               387007
PULocationID             476386
DOLocationID             476386
passenger_count          387007
trip_distance            476386
fare_amount              476386
extra                    476386
mta_tax                  476386
tip_amount               476386
tolls_amount             476386
ehail_fee                     0
improvement_surcharge    476386
total_amount             476386
payment_type             387007
trip_type                387005
congestion_surcharge     387007
dtype: int64

In [3]:
from sqlalchemy import create_engine

In [4]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [5]:
engine.connect()

In [14]:
print(pd.io.sql.get_schema(df, name='green_taxi_data', con=engine))

CREATE TABLE green_taxi_data (
	"VendorID" BIGINT,
	lpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	lpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	store_and_fwd_flag TEXT,
	"RatecodeID" BIGINT,
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	passenger_count BIGINT,
	trip_distance FLOAT(53),
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	ehail_fee FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	payment_type BIGINT,
	trip_type FLOAT(53),
	congestion_surcharge FLOAT(53)
)

In [11]:
df_iter = pd.read_csv('green_tripdata_2019-10.csv.gz', iterator=True, chunksize=100000, parse_dates=['lpep_pickup_datetime', 'lpep_dropoff_datetime'])

In [12]:
df = next(df_iter)

In [13]:
len(df)

100000

In [21]:
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

In [9]:
df.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2019-10-01 00:26:02,2019-10-01 00:39:58,N,1,112,196,1,5.88,18.0,0.50,0.5,0.00,0.0,NaN,0.3,19.30,2,1,0.0
1,1,2019-10-01 00:18:11,2019-10-01 00:22:38,N,1,43,263,1,0.80,5.0,3.25,0.5,0.00,0.0,NaN,0.3,9.05,2,1,0.0
2,1,2019-10-01 00:09:31,2019-10-01 00:24:47,N,1,255,228,2,7.50,21.5,0.50,0.5,0.00,0.0,NaN,0.3,22.80,2,1,0.0
3,1,2019-10-01 00:37:40,2019-10-01 00:41:49,N,1,181,181,1,0.90,5.5,0.50,0.5,0.00,0.0,NaN,0.3,6.80,2,1,0.0
4,2,2019-10-01 00:08:13,2019-10-01 00:17:56,N,1,97,188,1,2.52,10.0,0.50,0.5,2.26,0.0,NaN,0.3,13.56,1,1,0.0

In [15]:
df.head(n=0).to_sql(name='green_taxi_data', con=engine, if_exists='replace')

0

In [16]:
%time df.to_sql(name='green_taxi_data', con=engine, if_exists='append')

CPU times: user 8.16 s, sys: 161 ms, total: 8.32 s
Wall time: 14.5 s

1000

In [17]:
from time import time

In [18]:
while True:
    t_start = time()
    
    df = next(df_iter)

    # df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
    # df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

    df.to_sql(name='green_taxi_data', con=engine, if_exists='append')

    t_end = time()

    print('inserted another chunk, took %.3f second' % (t_end - t_start))

inserted another chunk, took 14.751 second
inserted another chunk, took 14.883 second

/tmp/ipykernel_18424/2881533572.py:4: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  df = next(df_iter)

inserted another chunk, took 15.047 second
inserted another chunk, took 9.776 second

StopIteration:

In [6]:
zone_df = pd.read_csv('taxi_zone_lookup.csv')

In [7]:
zone_df.count()

LocationID      265
Borough         265
Zone            264
service_zone    263
dtype: int64

In [8]:
zone_df.head(n=0).to_sql(name='taxi_zone', con=engine, if_exists='replace')

0

In [9]:
zone_df.to_sql(name='taxi_zone', con=engine, if_exists='append')

265

In [13]:
query = """
select * from taxi_zone
"""
pd.read_sql(query, con=engine)

     index  LocationID        Borough                     Zone service_zone
0        0           1            EWR           Newark Airport          EWR
1        1           2         Queens              Jamaica Bay    Boro Zone
2        2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3        3           4      Manhattan            Alphabet City  Yellow Zone
4        4           5  Staten Island            Arden Heights    Boro Zone
..     ...         ...            ...                      ...          ...
260    260         261      Manhattan       World Trade Center  Yellow Zone
261    261         262      Manhattan           Yorkville East  Yellow Zone
262    262         263      Manhattan           Yorkville West  Yellow Zone
263    263         264        Unknown                       NV         None
264    264         265        Unknown                     None         None

[265 rows x 5 columns]

In [12]:
q = """
select * from green_taxi_data limit 100
"""
pd.read_sql(q, con=engine)

,index,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,...,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,0,2,2019-10-01 00:26:02,2019-10-01 00:39:58,N,1,112,196,1,5.88,...,0.50,0.5,0.00,0.0,None,0.3,19.30,2,1.0,0.0
1,1,1,2019-10-01 00:18:11,2019-10-01 00:22:38,N,1,43,263,1,0.80,...,3.25,0.5,0.00,0.0,None,0.3,9.05,2,1.0,0.0
2,2,1,2019-10-01 00:09:31,2019-10-01 00:24:47,N,1,255,228,2,7.50,...,0.50,0.5,0.00,0.0,None,0.3,22.80,2,1.0,0.0
3,3,1,2019-10-01 00:37:40,2019-10-01 00:41:49,N,1,181,181,1,0.90,...,0.50,0.5,0.00,0.0,None,0.3,6.80,2,1.0,0.0
4,4,2,2019-10-01 00:08:13,2019-10-01 00:17:56,N,1,97,188,1,2.52,...,0.50,0.5,2.26,0.0,None,0.3,13.56,1,1.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,95,2,2019-10-01 00:02:53,2019-10-01 00:14:32,N,1,126,74,1,3.10,...,0.50,0.5,0.00,0.0,None,0.3,13.30,1,1.0,0.0
96,96,2,2019-10-01 00:18:45,2019-10-01 00:29:23,N,1,42,74,1,1.64,...,0.50,0.5,0.00,0.0,None,0.3,10.80,2,1.0,0.0
97,97,2,2019-10-01 00:41:32,2019-10-01 00:52:51,N,1,75,42,1,3.17,...,0.50,0.5,1.50,0.0,None,0.3,14.30,1,1.0,0.0
98,98,2,2019-10-01 00:36:54,2019-10-01 00:54:20,N,1,92,179,1,5.48,...,0.50,0.5,0.00,0.0,None,0.3,20.80,2,1.0,0.0
99,99,2,2019-10-01 00:21:27,2019-10-01 00:26:59,N,1,129,129,1,1.02,...,0.50,0.5,0.00,0.0,None,0.3,7.30,2,1.0,0.0

In [29]:
q3 = """
select distinct Trip_Segmentation, count(*) as count
from
(select 
    case when trip_distance <=1 then 'Up to 1 mile'
        when trip_distance >1 and trip_distance <= 3 then 'In between 1 and 3 miles'
        when trip_distance >3 and trip_distance <= 7 then 'In between 3 and 7 miles'
        when trip_distance >7 and trip_distance <= 10 then 'In between 7 and 10 miles'
        else 'Over 10 miles'
    end as Trip_Segmentation, *
from green_taxi_data 
where cast(lpep_pickup_datetime as date) >= '2019-10-01'
and cast(lpep_dropoff_datetime as date) < '2019-11-01') t
group by Trip_Segmentation
"""
pd.read_sql(q3, con=engine)

           trip_segmentation   count
0   In between 1 and 3 miles  198924
1   In between 3 and 7 miles  109603
2  In between 7 and 10 miles   27678
3              Over 10 miles   35189
4               Up to 1 mile  104802

In [25]:
q4 = """
select distinct cast(lpep_pickup_datetime as date) as Date, max(trip_distance) as Longest_trip
from green_taxi_data 
group by Date
order by Longest_trip desc limit 1
"""
pd.read_sql(q4, con=engine)

         date  longest_trip       sum
0  2019-10-31        515.89  57694.32

In [35]:
q5 = """
select distinct t."Zone", sum(g."total_amount")
from green_taxi_data g
join taxi_zone t
on g."PULocationID" = t."LocationID"
where cast(g."lpep_pickup_datetime" as date) = '2019-10-18'
group by t."Zone"
having sum(g."total_amount") > 13000
"""
pd.read_sql(q5, con=engine)

                  Zone       sum
0    East Harlem North  18686.68
1    East Harlem South  16797.26
2  Morningside Heights  13029.79

In [43]:
q6 = """
select t2."Zone", sum(g."tip_amount")
from green_taxi_data g
join taxi_zone t1
on g."PULocationID" = t1."LocationID"
join taxi_zone t2
on g."DOLocationID" = t2."LocationID"
where cast(g."lpep_pickup_datetime" as date) >= '2019-10-01'
and cast(g."lpep_pickup_datetime" as date) < '2019-11-01'
and t1."Zone" = 'East Harlem North'
group by t2."Zone"
order by sum(g."tip_amount") desc
"""
pd.read_sql(q6, con=engine)

                      Zone      sum
0    Upper East Side North  4935.36
1        East Harlem South  4076.44
2      Morningside Heights  3369.36
3           Yorkville West  3322.15
4    Upper West Side North  2942.32
..                     ...      ...
208              Laurelton     0.00
209          Prospect Park     0.00
210        Queensboro Hill     0.00
211         Queens Village     0.00
212          College Point     0.00

[213 rows x 2 columns]

In [46]:
q6 = """
select t2."Zone", max(g."tip_amount")
from green_taxi_data g
join taxi_zone t1
on g."PULocationID" = t1."LocationID"
join taxi_zone t2
on g."DOLocationID" = t2."LocationID"
where cast(g."lpep_pickup_datetime" as date) >= '2019-10-01'
and cast(g."lpep_pickup_datetime" as date) < '2019-11-01'
and t1."Zone" = 'East Harlem North'
group by t2."Zone"
order by max(g."tip_amount") desc
"""
pd.read_sql(q6, con=engine)

                      Zone    max
0              JFK Airport  87.30
1           Yorkville West  80.88
2        East Harlem North  40.00
3           Newark Airport  26.45
4    Upper East Side North  18.45
..                     ...    ...
208          Dyker Heights   0.00
209          Prospect Park   0.00
210        Queensboro Hill   0.00
211                Erasmus   0.00
212         Queens Village   0.00

[213 rows x 2 columns]